#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	ЗарегистрироватьКОтправкеВМобильноеПриложение()
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗарегистрироватьКОтправкеВМобильноеПриложение();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ОбменСМобильным.Ссылка КАК Ссылка
					|ИЗ
					|	ПланОбмена.ОбменСМобильным КАК ОбменСМобильным
					|	И НЕ ОбменСМобильным.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
			
		КонецЦикла
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти