#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	ЗарегистрироватьКОтправкеВМобильноеПриложение()
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗарегистрироватьКОтправкеВМобильноеПриложение();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ОбменСМобильным.Ссылка КАК Ссылка
					|ИЗ
					|	ПланОбмена.ОбменСМобильным КАК ОбменСМобильным";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла
	
КонецПроцедуры
#КонецОбласти