#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли
	;

	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
		ЗарегистрироватьКОтправкеВМобильноеПриложение();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗарегистрироватьКОтправкеВМобильноеПриложение()
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ОбменСМобильным.Ссылка КАК Ссылка
					|ИЗ
					|	ПланОбмена.ОбменСМобильным КАК ОбменСМобильным
					|ГДЕ
					|	НЕ ОбменСМобильным.ПометкаУдаления
					|	И НЕ ОбменСМобильным.ЭтотУзел";

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
				ОбменДанными.Получатели.Добавить(Выборка.Ссылка);		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти