#Область ОбработчикиСобытий
Функция ПроверитьДоступность(Запрос)
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки("Ок");
		Возврат Ответ;
КонецФункции

Функция ПолучитьДанные(Запрос)
	
	Попытка
		Возврат КЛ_ОбменДанными.ОбработатьВходящийЗапрос(Запрос);
	Исключение
		ЗаписьЖурналаРегистрации("ОбменСМобильным.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ОтправитьДанные(Запрос)
	
	Попытка
		Возврат КЛ_ОбменДанными.ОбработатьВходящийЗапрос(Запрос);
	Исключение
		ЗаписьЖурналаРегистрации("ОбменСМобильным.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("ОК");
	Возврат Ответ;
	
	
	
КонецФункции
#КонецОбласти