#Область ОбработчикиСобытий
Функция ПроверитьДоступность(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Ок");
	Возврат Ответ;
КонецФункции

Функция ПолучитьЗаказы(Запрос)
	МобильныйПользователь = Запрос.Заголовки.Получить("X-UserName");
	
//--Попытка обойти ограничение передачи кирилицы в заголовках http запросов--
	Если МобильныйПользователь = "Courier" Тогда
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Курьер");
	ИначеЕсли МобильныйПользователь = "Administrator" Тогда
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	КонецЕсли;
//---------------------------------------------------------------------------
	КоличествоЗаказов = ПолучитьДанныеПоЗаказам(Пользователь);

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(Строка(КоличествоЗаказов));
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьДанныеПоЗаказам(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ЗаказПокупателя.Ссылка) КАК Количество
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Ответственный", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Количество;
	
КонецФункции
#КонецОбласти